app/views/repair_requests/_form.html.erb

	<% if current_user && (current_user.has_role? :manager) %>
	<%= f.collection_select :submitter_id, User.all.collect, :id, :username, :prompt => "Select a Renter"%>
---
SELECT "users".* FROM "users"