app/views/users/_form.html.erb

	<div>
	<%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %>
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 2
SELECT 1 AS one FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" IS NULL AND "roles"."id" = 1 LIMIT 1