app/controllers/repair_requests_controller.rb

  def index
	if current_user && (current_user.has_role? :manager)
		@repair_requests = RepairRequest.all
	end
	if current_user && (current_user.has_role? :renter)
		@repair_requests = RepairRequest.where(:submitter_id => current_user)
---
SELECT "repair_requests".* FROM "repair_requests"
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."submitter_id" = 2

  def show
    @repair_request = RepairRequest.find(params[:id])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @repair_request = RepairRequest.find(params[:id])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @repair_request = RepairRequest.new(params[:repair_request])


    respond_to do |format|
      if @repair_request.save
---
INSERT INTO "repair_requests" ("close_date", "created_at", "open_date", "request_details", "request_response", "responder_id", "submitter_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @repair_request = RepairRequest.find(params[:id])

    respond_to do |format|
      if @repair_request.update_attributes(params[:repair_request])
---
SELECT "repair_requests".* FROM "repair_requests" WHERE "repair_requests"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "repair_requests" SET "request_response" = '', "close_date" = '2013-02-24', "updated_at" = '2013-02-24 23:40:19.732890' WHERE "repair_requests"."id" = 1