app/controllers/users_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
	@user = User.new(params[:user])

    @renterrole = Role.find(1);